import math

print("Fuel costs")

a = 14  # кількість витрачених літрів пального на 100 км
b = 47.63  # ціна за 1 л
c = 287  # відстань яку треба проїхати

print((c * a) / 100)

x = 40.18  #

print(round(x * b, 2))

z = 1913.77  # вартість пального на всю поїздку

print("Income tax")

a = 549085.67  # загальна сума доходу
b = 5  # відсоток податку

print(round((a * b) / 100, 2))

x = 27454.28  # податок який треба сплатити

print(a - x)

z = 521631.39  # чистий прибуток

print("Paying bills")

a = 235  # попередні показники холодної води
b = 241  # поточні показники холодної води
c = 16.164  # тариф за 1 кубометр води

input("Введіть ваші попередні показники")

input("Введіть ваші поточні показники")

print(f'Сума до оплати {round((b - a) * c, 2)}')

x = 96.98  # грн треба сплатити

print("Сonverting degrees to radians")

a = 360  # градуси які треба перевести в радіани
b = math.pi  # відомо, що 180 градусів це Pi радіан

input("Скільки градусів перевести в радіани?")

print(round((b * a) / 180, 5))
